In [29]:
# Import libraries
import pandas as pd
import re
import requests as req
from bs4 import BeautifulSoup as bs
import json
import warnings
warnings.simplefilter('ignore')
from sqlalchemy import create_engine

# MySQL

In [30]:
a= open("../Password.txt","r").read()

In [15]:
str_conn=f"mysql+pymysql://root:{a}@localhost:3306"

motor=create_engine(str_conn)  # motor de conexion

In [16]:
motor.execute('create database moma;')

In [17]:
str_conn=f"mysql+pymysql://root:{a}@localhost:3306/Moma"

motor=create_engine(str_conn)

In [31]:
artist=pd.read_csv('data/moma.csv')
artist.head(3)

  Classification  year                    artist      country
0   Architecture  1987  Christian de Portzamparc       France
1   Architecture  1987              Rem Koolhaas  Netherlands
2   Architecture  1987       Madelon Vriesendorp  Netherlands

In [19]:
artist.to_sql(name='Artists', con=motor, if_exists='append', index=False)

In [20]:
pd.read_sql('select * from Artists', motor).head(3)

  Classification  year                    artist      country
0   Architecture  1987  Christian de Portzamparc       France
1   Architecture  1987              Rem Koolhaas  Netherlands
2   Architecture  1987       Madelon Vriesendorp  Netherlands

In [32]:
education=pd.read_csv('data/education.csv')
education.head(3)

   Rank        Country  Technology  Talent  Tolerance  Global_Creativity_Index
0     1      Australia         7.0     1.0        4.0                    0.970
1     2  United States         4.0     3.0       11.0                    0.950
2     3    New Zealand         7.0     8.0        3.0                    0.949

In [22]:
education.to_sql(name='education', con=motor, if_exists='append', index=False)

In [23]:
pd.read_sql('select * from Education', motor).head(3)

   Rank        Country  Technology  Talent  Tolerance  Global_Creativity_Index
0     1      Australia         7.0     1.0        4.0                    0.970
1     2  United States         4.0     3.0       11.0                    0.950
2     3    New Zealand         7.0     8.0        3.0                    0.949

In [ ]:
#data=pd.read_csv('df_80.csv')
#data.head(3)

In [ ]:
#df_80.to_sql(name='GDP_80', con=motor, if_exists='append', index=False)

In [ ]:
#pd.read_sql('select * from GDP_80', motor).head(3)

In [ ]:
#data=pd.read_csv('df_99.csv')
#data.head(3)

In [ ]:
#df_99.to_sql(name='GDP_99', con=motor, if_exists='append', index=False)

In [ ]:
#pd.read_sql('select * from GDP_99', motor).head(3)

In [33]:
df_10=pd.read_csv('data/df_10.csv')
df_10.head(3)

          Country    Date     AnnualGDP    AnnualGDP1 GDP _Growth_percentage
0   United States  2010.0  €11,351,739M  $15,049,000M                   2.7%
1       Euro zone  2010.0   €9,472,472M  $12,629,070M                   2.2%
2  United Kingdom  2010.0   €1,872,176M   $2,484,020M                   2.1%

In [25]:
df_10.to_sql(name='GDP_10', con=motor, if_exists='append', index=False)

In [26]:
pd.read_sql('select * from GDP_10', motor).head(3)

          Country    Date     AnnualGDP    AnnualGDP1 GDP _Growth_percentage
0   United States  2010.0  €11,351,739M  $15,049,000M                   2.7%
1       Euro zone  2010.0   €9,472,472M  $12,629,070M                   2.2%
2  United Kingdom  2010.0   €1,872,176M   $2,484,020M                   2.1%

In [ ]:
#df_20=pd.read_csv('df_20.csv')
#df_20.head(3)

In [ ]:
#df_20.to_sql(name='GDP_20', con=motor, if_exists='append', index=False)

In [ ]:
#pd.read_sql('select * from GDP_20', motor).head(3)

In [27]:
query=pd.read_sql('''
                    select Artists.Classification, Artists.year, Artists.artist, Education.Country, Education.Rank, Education.Global_Creativity_Index, GDP_10.AnnualGDP
                    from Artists
                    left join Education
                    on Artists.country=Education.Country
                    left join GDP_10
                    on GDP_10.Country=Education.Country
                    group by Education.Country;
                    ''',
                motor)

In [ ]:
query=pd.read_sql('''
                    select Artists.Classification, Artists.year, Artists.artist, Education.Country, Education.Rank, Education.Global_Creativity_Index, GDP.AnnualGDP
                    from Artists
                    left join Education
                    on Artists.country=Education.Country
                    left join GDP
                    on GDP.Country=Education.Country
                    group by Education.Country;
                    ''',
                motor)

In [28]:
query

,Classification,year,artist,Country,Rank,Global_Creativity_Index,AnnualGDP
0,Architecture,1987,Christian de Portzamparc,France,16.0,0.822,"€1,995,289M"
1,Architecture,1987,Rem Koolhaas,Netherlands,10.0,0.889,"€639,187M"
2,Architecture,1979,Roger C. Ferri,United States,2.0,0.950,"€11,351,739M"
3,Architecture,1974,Aldo Rossi,Italy,21.0,0.715,"€1,611,279M"
4,Architecture,1979,Peter Cook,United Kingdom,12.0,0.881,"€1,872,176M"
...,...,...,...,...,...,...,...
81,Video,2006,Garin Nugroho,Indonesia,115.0,0.202,"€570,030M"
82,Video,2007,Nan Achnas,Singapore,9.0,0.896,"€181,102M"
83,Video,2006,Jeffrey Jeturian,Philippines,52.0,0.487,"€157,342M"
84,Film,2006,João Luis Sol de Carvalho,Mozambique,90.0,0.346,"€8,377M"
85,Design,1972,Velazquez Ribero,Dominican Republic,78.0,0.380,"€41,683M"